Repository: AlexHa2/GreenConnectMobile
Catalog: assets/l10n/app_*.arb
Languages: vi

source: Confirm Delete
vi: Xác Nhận Xóa

# are_you_sure_delete_pricing
source: Are you sure you want to delete this pricing item?
vi: Bạn có chắc chắn muốn xóa mục giá này?

source: Unit is required
vi: Đơn vị là bắt buộc

source: Submit Offer
vi: Gửi đề nghị

source: Offer created successfully
vi: Tạo đề nghị thành công

source: Failed to create offer
vi: Tạo đề nghị thất bại

source: Please select at least one item
vi: Vui lòng chọn ít nhất một mặt hàng

source: Please select proposed time
vi: Vui lòng chọn thời gian đề xuất

# must_take_all_items
source: You must take all items in this post
vi: Bạn phải nhận tất cả các mặt hàng trong bài đăng này

source: Select Items
vi: Chọn mặt hàng

source: Message (Optional)
vi: Tin nhắn (Tùy chọn)

# enter_your_message
source: Enter your message here...
vi: Nhập tin nhắn của bạn...

source: Message is required
vi: Tin nhắn là bắt buộc

source: Price per Unit
vi: Giá đơn vị

source: Please enter price
vi: Vui lòng nhập giá

source: Unit
vi: Đơn vị

source: Select date and time
vi: Chọn ngày và giờ

source: Creating...
vi: Đang tạo...

source: Make an Offer
vi: Đưa ra đề nghị

source: Available Posts
vi: Bài đăng khả dụng

# enter_message
source: Enter your message
vi: Nhập tin nhắn của bạn

# please_enter_message
source: Please enter a message
vi: Vui lòng nhập tin nhắn

# offer_canceled_success
source: Offer canceled successfully
vi: Hủy đề nghị thành công

# offer_restored_success
source: Offer restored successfully
vi: Khôi phục đề nghị thành công

source: Action failed
vi: Thao tác thất bại

# member_since
source: Member since {date}
vi: Thành viên từ {date}

# response_message
source: Response
vi: Phản hồi

# no_response
source: No response yet
vi: Chưa có phản hồi

source: Total Amount
vi: Tổng giá trị

# estimated_total
source: Estimated: {amount} VND
vi: Ước tính: {amount} VND

# post_description
source: Description
vi: Mô tả

source: Posted at
vi: Đăng lúc

# offer_created_at
source: Offer created
vi: Đề nghị được tạo

# scheduleListTitle
source: Schedules
vi: Lịch hẹn

# scheduleStatusAll
source: All
vi: Tất cả

# scheduleStatusPending
source: Pending
vi: Chờ xử lý

# scheduleStatusAccepted
source: Accepted
vi: Đã chấp nhận

# scheduleStatusRejected
source: Rejected
vi: Đã từ chối

# scheduleStatusCanceled
source: Canceled
vi: Đã hủy

# scheduleEmptyMessage
source: No schedules found
vi: Không tìm thấy lịch hẹn

# scheduleCreatedAt
source: Created at
vi: Tạo lúc

# scheduleDetailTitle
source: Schedule Details
vi: Chi tiết lịch hẹn

# scheduleProposedTime
source: Proposed Time
vi: Thời gian đề xuất

# scheduleResponseMessage
source: Response Message
vi: Tin nhắn phản hồi

# scheduleNoResponse
source: No response
vi: Chưa có phản hồi

# scheduleAcceptButton
source: Accept
vi: Chấp nhận

# scheduleRejectButton
source: Reject
vi: Từ chối

# scheduleCancelButton
source: Cancel
vi: Hủy

# scheduleRestoreButton
source: Restore
vi: Khôi phục

# scheduleRescheduleButton
source: Reschedule
vi: Đổi lịch

# scheduleConfirmAccept
source: Confirm Accept Schedule
vi: Xác nhận chấp nhận lịch hẹn

# scheduleConfirmReject
source: Confirm Reject Schedule
vi: Xác nhận từ chối lịch hẹn

# scheduleConfirmCancel
source: Confirm Cancel Schedule
vi: Xác nhận hủy lịch hẹn

# scheduleAcceptMessage
source: Are you sure you want to accept this schedule?
vi: Bạn có chắc chắn muốn chấp nhận lịch hẹn này?

# scheduleRejectMessage
source: Are you sure you want to reject this schedule?
vi: Bạn có chắc chắn muốn từ chối lịch hẹn này?

# scheduleCancelMessage
source: Are you sure you want to cancel this schedule?
vi: Bạn có chắc chắn muốn hủy lịch hẹn này?

# scheduleAcceptSuccess
source: Schedule accepted successfully
vi: Chấp nhận lịch hẹn thành công

# scheduleRejectSuccess
source: Schedule rejected successfully
vi: Từ chối lịch hẹn thành công

# scheduleAcceptNote
source: Use 'Accept Offer' button below to accept schedule
vi: Dùng nút 'Chấp nhận đề nghị' bên dưới để chấp nhận lịch hẹn

# scheduleRejectShort
source: Reject
vi: Từ chối

# scheduleCancelSuccess
source: Schedule canceled successfully
vi: Hủy lịch hẹn thành công

# scheduleRestoreSuccess
source: Schedule restored successfully
vi: Khôi phục lịch hẹn thành công

# scheduleUpdateSuccess
source: Schedule updated successfully
vi: Cập nhật lịch hẹn thành công

# schedule_hint_swipe_to_reject
source: Use the 'Accept Proposal' button below to accept the schedule
vi: Dùng nút 'Chấp nhận đề nghị' bên dưới để chấp nhận lịch hẹn

source: Transactions
vi: Giao dịch

source: My Transactions
vi: Giao dịch của tôi

source: Transaction Details
vi: Chi tiết giao dịch

source: Transaction ID
vi: Mã giao dịch

# transaction_status
source: Status
vi: Trạng thái

source: Scheduled Time
vi: Thời gian hẹn

source: Check-in Time
vi: Thời gian check-in

source: Completed Time
vi: Thời gian hoàn thành

# collector_info
source: Collector Information
vi: Thông tin người thu gom

# household_info
source: Household Information
vi: Thông tin hộ gia đình

source: Transaction Items
vi: Danh sách vật phẩm

source: Total Weight
vi: Tổng khối lượng

source: Total Value
vi: Tổng giá trị

source: Collector Note
vi: Ghi chú người thu gom

source: Household Note
vi: Ghi chú hộ gia đình

source: Input Details
vi: Nhập chi tiết

source: Process Transaction
vi: Xử lý giao dịch

source: Cancel Transaction
vi: Hủy giao dịch

source: Provide Feedback
vi: Đánh giá

# transaction_feedbacks
source: Feedbacks
vi: Đánh giá

source: In Progress
vi: Đang thực hiện

source: Awaiting Confirmation
vi: Chờ xác nhận

source: Cancelled
vi: Đã hủy

# check_in_success
source: Checked in successfully
vi: Check-in thành công

# check_in_confirm
source: Confirm Check-in
vi: Xác nhận Check-in

# check_in_message
source: Are you sure you want to check in at this location?
vi: Bạn có chắc chắn muốn check-in tại vị trí này?

# input_details_title
source: Input Transaction Details
vi: Nhập thông tin giao dịch

# enter_weight
source: Enter Weight (kg)
vi: Nhập khối lượng (kg)

source: Enter Value ($)
vi: Nhập giá trị ($)

# enter_note
source: Enter Note (Optional)
vi: Nhập ghi chú (Tùy chọn)

# details_saved
source: Details saved successfully
vi: Lưu thông tin thành công

# approve_confirm
source: Approve Transaction
vi: Phê duyệt giao dịch

# reject_confirm
source: Reject Transaction
vi: Từ chối giao dịch

# approve_message
source: Are you sure you want to approve this transaction?
vi: Bạn có chắc chắn muốn phê duyệt giao dịch này?

# reject_message
source: Are you sure you want to reject this transaction?
vi: Bạn có chắc chắn muốn từ chối giao dịch này?

# transaction_approved
source: Transaction approved successfully
vi: Phê duyệt giao dịch thành công

# transaction_rejected
source: Transaction rejected successfully
vi: Từ chối giao dịch thành công

# cancel_confirm
source: Cancel Transaction
vi: Hủy giao dịch

# cancel_message
source: Are you sure you want to cancel this transaction?
vi: Bạn có chắc chắn muốn hủy giao dịch này?

# transaction_cancelled
source: Transaction cancelled successfully
vi: Hủy giao dịch thành công

# feedback_submitted
source: Feedback submitted successfully
vi: Gửi đánh giá thành công

source: No transactions found
vi: Không tìm thấy giao dịch

source: Pull to refresh
vi: Kéo để làm mới

source: Refreshing...
vi: Đang làm mới...

source: Scrap Type
vi: Loại phế liệu

source: Total Price
vi: Tổng giá

source: Your Offer Price
vi: Giá chào của bạn

source: Enter total price for this item
vi: Nhập tổng giá cho mặt hàng này

source: Price must be greater than zero
vi: Giá phải lớn hơn 0

source: Provided by
vi: Đánh giá bởi

# at_time
source: at
vi: lúc

# error_weight_required
source: Weight is required
vi: Vui lòng nhập khối lượng

# error_value_required
source: Value is required
vi: Vui lòng nhập giá trị

# error_check_in_failed
source: Check-in failed
vi: Check-in thất bại

# error_input_details_failed
source: Failed to input details
vi: Nhập thông tin thất bại

# error_process_failed
source: Failed to process transaction
vi: Xử lý giao dịch thất bại

# error_cancel_failed
source: Failed to cancel transaction
vi: Hủy giao dịch thất bại

# error_feedback_failed
source: Failed to submit feedback
vi: Gửi đánh giá thất bại

# transaction_info
source: Transaction Information
vi: Thông tin giao dịch

source: Transaction Information
vi: Thông tin giao dịch

# transaction_created_time
source: Created At
vi: Thời gian tạo

# transaction_updated_time
source: Updated At
vi: Thời gian cập nhật

# offer_info
source: Offer Information
vi: Thông tin đề nghị

# post_address
source: Collection Address
vi: Địa chỉ thu gom

source: No feedbacks yet
vi: Chưa có đánh giá

source: My Feedbacks
vi: Đánh giá của tôi

source: All Feedbacks
vi: Tất cả đánh giá

source: Feedback List
vi: Danh sách đánh giá

source: Sort Feedbacks
vi: Sắp xếp đánh giá

# no_feedbacks_found
source: No feedbacks available at the moment
vi: Không có phản hồi nào hiện tại

# no_feedbacks_available
source: No feedbacks available at the moment
vi: Hiện tại chưa có đánh giá nào

source: Rated by
vi: Đánh giá bởi

source: Rated for
vi: Đánh giá cho

# transaction_ref
source: Transaction
vi: Giao dịch

source: stars
vi: sao

source: Feedback Details
vi: Chi tiết phản hồi

source: Feedback Information
vi: Thông tin đánh giá

source: Reviewer Information
vi: Thông tin người đánh giá

source: Reviewee Information
vi: Thông tin người được đánh giá

source: Given Rating
vi: Đánh giá

# feedback_comment
source: Comment
vi: Bình luận

# no_comment
source: No comment provided
vi: Không có bình luận

source: Feedback Date
vi: Ngày đánh giá

source: Edit Feedback
vi: Chỉnh sửa đánh giá

source: Delete Feedback
vi: Xóa phản hồi

# confirm_delete_feedback
source: Delete Feedback
vi: Xóa đánh giá

# delete_feedback_message
source: Are you sure you want to delete this feedback? This action cannot be undone.
vi: Bạn có chắc chắn muốn xóa đánh giá này? Hành động này không thể hoàn tác.

# feedback_deleted_success
source: Feedback deleted successfully
vi: Xóa đánh giá thành công

# feedback_updated_success
source: Feedback updated successfully
vi: Cập nhật đánh giá thành công

# update_feedback_failed
source: Failed to update feedback
vi: Cập nhật đánh giá thất bại

# delete_feedback_failed
source: Failed to delete feedback
vi: Xóa đánh giá thất bại

source: View Transaction
vi: Xem giao dịch

# member_info
source: Member Information
vi: Thông tin thành viên

# contact_info
source: Contact Information
vi: Thông tin liên hệ

source: Approve
vi: Phê duyệt

source: Rewards
vi: Phần thưởng

source: Messages
vi: Tin nhắn

source: Sort By
vi: Sắp xếp theo

source: Order
vi: Thứ tự

source: Newest First
vi: Mới nhất trước

source: Oldest First
vi: Cũ nhất trước

source: Sort by last updated
vi: Sắp xếp theo lần cập nhật gần nhất

source: Sort by creation date
vi: Sắp xếp theo ngày tạo

# most_recent_at_top
source: Most recent at the top
vi: Gần đây nhất ở trên

# earliest_at_top
source: Earliest at the top
vi: Sớm nhất ở trên

source: Emergency Cancel
vi: Hủy Khẩn Cấp

# emergency_cancel_confirm
source: Emergency Cancellation
vi: Hủy Giao Dịch Khẩn Cấp

# emergency_cancel_message
source: This will cancel the transaction due to emergency reasons (vehicle breakdown, unable to contact, etc.). Are you sure?
vi: Điều này sẽ hủy giao dịch do lý do khẩn cấp (xe hỏng, không liên lạc được, v.v.). Bạn có chắc chắn?

# emergency_cancel_note
source: For emergency situations only: vehicle breakdown, unable to contact customer, extreme weather, etc.
vi: Chỉ dùng cho các trường hợp khẩn cấp: xe hỏng, không liên lạc được khách hàng, thời tiết xấu, v.v.

# transaction_emergency_canceled
source: Transaction cancelled due to emergency
vi: Đã hủy giao dịch do khẩn cấp

source: Resume Transaction
vi: Tiếp Tục Giao Dịch

# resume_confirm
source: Resume Transaction
vi: Tiếp Tục Giao Dịch

# resume_message
source: This will resume the transaction and change status back to In Progress. Are you sure?
vi: Điều này sẽ tiếp tục giao dịch và đổi trạng thái về Đang Thực Hiện. Bạn có chắc chắn?

source: Resume
vi: Tiếp tục

# transaction_resumed
source: Transaction resumed successfully
vi: Đã tiếp tục giao dịch thành công

# operation_failed
source: Operation failed. Please try again.
vi: Thao tác thất bại. Vui lòng thử lại.

source: Scheduled
vi: Đã lên lịch

# feedback
source: Feedbacks
vi: Đánh giá

source: Transaction
vi: Giao dịch

# for_transaction
source: For
vi: Dành cho

# delete_feedback_confirm
source: Are you sure you want to delete this feedback? This action cannot be undone.
vi: Bạn có chắc muốn xóa phản hồi này? Hành động này không thể hoàn tác.

# feedback_delete_success
source: Feedback deleted successfully
vi: Xóa phản hồi thành công

# feedback_delete_failed
source: Failed to delete feedback
vi: Xóa phản hồi thất bại

source: Feedback Not Found
vi: Không tìm thấy phản hồi

# feedback_may_deleted
source: This feedback may have been deleted
vi: Phản hồi này có thể đã bị xóa

source: feedback may have been deleted
vi: Đánh giá này có lẽ đã bị xóa rồi

source: Comment
vi: Nội dung đánh giá

source: Update Feedback
vi: Cập nhật đánh giá

source: Edit Your Feedback
vi: Chỉnh sửa đánh giá của bạn

source: Update Rating
vi: Cập nhật đánh giá

source: Update Comment
vi: Cập nhật bình luận

source: Enter your comment
vi: Nhập bình luận của bạn

# rating_required
source: Rating is required
vi: Vui lòng chọn đánh giá

source: Save Changes
vi: Lưu thay đổi

source: Review
vi: Đánh giá

source: Complain
vi: Phản ánh

source: Write Review
vi: Viết đánh giá

source: File Complaint
vi: Gửi khiếu nại

source: Create Feedback
vi: Tạo đánh giá

source: Rate Transaction
vi: Đánh giá giao dịch

source: Your Rating
vi: Đánh giá của bạn

source: Tap to rate
vi: Nhấn để đánh giá

# write_comment
source: Write your comment
vi: Viết bình luận

# comment_placeholder
source: Share your experience with this transaction...
vi: Chia sẻ trải nghiệm của bạn về giao dịch này...

# rating_description
source: How would you rate your experience?
vi: Bạn cảm thấy thế nào về trải nghiệm này?

# comment_required
source: Please provide a comment
vi: Vui lòng cung cấp bình luận

# feedback_created_success
source: Feedback created successfully
vi: Tạo đánh giá thành công

# create_feedback_failed
source: Failed to create feedback
vi: Tạo đánh giá thất bại

source: Poor
vi: Kém

source: Fair
vi: Trung bình

source: Good
vi: Tốt

source: Very Good
vi: Rất tốt

source: Excellent
vi: Xuất sắc

# ai_cannot_analyze
source: AI cannot analyze. Please enter information manually (image will be uploaded when creating post).
vi: AI không thể phân tích. Vui lòng nhập thông tin thủ công (ảnh sẽ được upload khi tạo post).

# ai_cannot_analyze_update
source: AI cannot analyze. Please enter information manually (image will be uploaded when updating post).
vi: AI không thể phân tích. Vui lòng nhập thông tin thủ công (ảnh sẽ được upload khi update post).

# error_analyze_image
source: Error analyzing image. Please enter information manually.
vi: Lỗi phân tích hình ảnh. Vui lòng nhập thông tin thủ công.

source: AI Recognition
vi: AI Nhận Diện

source: Item
vi: Vật phẩm

source: Recyclable
vi: Tái chế

source: Yes
vi: Có

source: No
vi: Không

source: Estimated
vi: Ước lượng

source: Advice
vi: Lời khuyên

# info_auto_filled
source: Information has been automatically filled. You can edit before adding.
vi: Thông tin đã được điền tự động. Bạn có thể chỉnh sửa trước khi thêm.

source: Close
vi: Đóng

# please_select_image
source: Please select an image
vi: Vui lòng chọn hình ảnh

# please_select_category
source: Please select a category
vi: Vui lòng chọn danh mục

# item_added_success
source: Item added successfully
vi: Đã thêm item thành công

# error_get_upload_url
source: Failed to get upload URL
vi: Lấy URL upload lỗi

# error_upload_image
source: Error uploading image: {error}
vi: Lỗi upload ảnh: {error}

# ai_will_auto_recognize
source: AI will automatically recognize after selecting image
vi: AI sẽ tự động nhận diện sau khi chọn ảnh

# ai_will_auto_analyze
source: AI will automatically analyze the image
vi: AI sẽ tự động phân tích hình ảnh

# ai_analyzing
source: AI is analyzing the image and automatically filling information...
vi: AI đang phân tích hình ảnh và tự động điền thông tin...

# image_will_upload
source: Image will be uploaded when creating post. Please enter information manually.
vi: Ảnh sẽ được upload khi tạo bài post. Vui lòng nhập thông tin thủ công.

source: Analyzing...
vi: Đang phân tích...

# ai_connect_error
source: AI connection error. You can enter information manually, images will be uploaded when updating the post.
vi: Lỗi kết nối AI. Bạn có thể nhập thông tin thủ công, ảnh sẽ được upload khi update post.

source: Complaints
vi: Khiếu nại

source: Feedbacks
vi: Đánh giá

# complaint_submitted
source: Submitted
vi: Đã gửi

# complaint_in_review
source: In Review
vi: Đang xem xét

# complaint_resolved
source: Resolved
vi: Đã giải quyết

# complaint_dismissed
source: Dismissed
vi: Đã từ chối

source: Complaint List
vi: Danh sách khiếu nại

source: Sort by Date
vi: Sắp xếp theo ngày

source: Sort by location
vi: Sắp xếp theo vị trí

# sort_ascending
source: Ascending
vi: Tăng dần

# sort_descending
source: Descending
vi: Giảm dần

source: Filter by Status
vi: Lọc theo trạng thái

# no_complaints
source: No complaints yet
vi: Chưa có khiếu nại nào

source: Complaint Reason
vi: Lý do khiếu nại

source: Complainant
vi: Người khiếu nại

source: accused
vi: Người bị tố cáo

source: Created At
vi: Tạo lúc

source: Complaint Detail
vi: Chi tiết khiếu nại

source: Complaint ID
vi: Mã khiếu nại

source: Complaint Information
vi: Thông tin khiếu nại

source: Participants
vi: Người tham gia

source: Evidence
vi: Bằng chứng

source: Update Complaint
vi: Cập nhật khiếu nại

# update_complaint_subtitle
source: Update your complaint details
vi: Cập nhật chi tiết khiếu nại của bạn

source: Create Complaint
vi: Tạo khiếu nại

# create_complaint_subtitle
source: Report an issue with this transaction
vi: Báo cáo sự cố với giao dịch này

# enter_complaint_reason_hint
source: Describe the issue you encountered with this transaction...
vi: Mô tả vấn đề bạn gặp phải với giao dịch này...

# minimum_10_characters
source: Minimum 10 characters required
vi: Tối thiểu 10 ký tự

# reason_too_short
source: Reason must be at least 10 characters
vi: Lý do phải có ít nhất 10 ký tự

# please_select_evidence_image
source: Please select an evidence image
vi: Vui lòng chọn hình ảnh bằng chứng

source: Evidence selected
vi: Đã chọn bằng chứng

source: No evidence selected
vi: Chưa chọn bằng chứng

# tap_below_to_select_image
source: Tap below to select an image
vi: Nhấn bên dưới để chọn hình ảnh

source: Select Evidence Image
vi: Chọn hình ảnh bằng chứng

source: Submit Complaint
vi: Gửi khiếu nại

# complaint_created_success
source: Complaint created successfully
vi: Tạo khiếu nại thành công

source: Failed to create complaint
vi: Tạo khiếu nại thất bại

# complaint_info_note
source: All fields are required. Please provide clear evidence and detailed reason for better processing.
vi: Tất cả các trường đều bắt buộc. Vui lòng cung cấp bằng chứng rõ ràng và lý do chi tiết để xử lý tốt hơn.

source: Image attached
vi: Đã đính kèm hình ảnh

# error_load_image
source: Failed to load image
vi: Không thể tải hình ảnh

source: No evidence attached
vi: Chưa có bằng chứng

# change_evidence_image
source: Change Evidence
vi: Thay đổi bằng chứng

source: Add Evidence Image
vi: Thêm hình ảnh bằng chứng

# please_enter_reason
source: Please enter a reason
vi: Vui lòng nhập lý do

source: Reopen Complaint
vi: Mở lại khiếu nại

# reopen_complaint_confirm
source: Are you sure you want to reopen this complaint?
vi: Bạn có chắc muốn mở lại khiếu nại này?

# reopen_success
source: Complaint reopened successfully
vi: Mở lại khiếu nại thành công

# update_success
source: Updated successfully
vi: Cập nhật thành công

# transaction_scheduled
source: Scheduled
vi: Đã lên lịch

# transaction_inProgress
source: In progress
vi: Đang xử lý

# transaction_completed
source: Completed
vi: Hoàn thành

# transaction_canceledBySystem
source: Canceled by system
vi: Hệ thống đã hủy

# transaction_canceledByUser
source: Canceled by user
vi: Người dùng đã hủy

# enter_complaint_reason
source: Enter your complaint reason...
vi: Nhập lý do bạn khiếu nại...

source: New image
vi: Ảnh mới

source: ton
vi: tấn

source: piece
vi: món

source: Offers
vi: Thu gom

source: failed to update pricing
vi: thất bại khi cập nhật giá

source: failed to delete pricing
vi: thất bại khi xóa giá
