Repository: AlexHa2/GreenConnectMobile
Catalog: assets/l10n/app_*.arb
Languages: vi

# hello_first
source: Connect to
vi: Kết nối với

# hello_second
source: Green Future
vi: Tương lai xanh

# welcome
source: Welcome to Green Connect
vi: Chào mừng đến với Green Connect

# welcome_login_primary
source: Welcome Back!
vi: Chào mừng trở lại!

# welcome_login_secondary
source: Login to continue your green journey
vi: Đăng nhập để tiếp tục hành trình xanh của bạn

# welcome_register_primary
source: Join Green Connect
vi: Tạo tài khoản mới

# welcome_register_secondary
source: Start your sustainable journey today
vi: Đăng ký để bắt đầu hành trình xanh của bạn

source: Register Complete
vi: Hoàn thành đăng ký

source: Register here
vi: Đăng ký ở đây

source: Login Complete
vi: Hoàn thành đăng nhập

source: Login
vi: Đăng nhập

source: Login here
vi: Đăng nhập ở đây

source: Already have account ?
vi: Đã có tài khoản ?

# dont_have_account
source: Don't have an account ?
vi: Chưa có tài khoản ?

source: Logout
vi: Đăng xuất

source: Username
vi: Tên người dùng

source: Password
vi: Mật khẩu

source: Phone Number
vi: Số điện thoại

# select_role
source: Select Your Role
vi: Chọn vai trò của bạn

# select_image
source: Select Your Image
vi: Chọn hình đại diện của bạn

source: Register
vi: Đăng ký

source: Send
vi: Gửi

source: Create
vi: Tạo mới

source: Update
vi: Cập nhật

source: Delete
vi: Xóa

source: Cancel
vi: Hủy

source: Pricing updated successfully
vi: Cập nhật giá thành công

source: Pricing deleted successfully
vi: Xóa giá thành công

# error_occurred
source: An error occurred
vi: Đã xảy ra lỗi

# error_all_field
source: Please fill all required fields
vi: Vui lòng nhập hết các trường được yêu cầu

source: upload
vi: Tải lên

source: Post
vi: bài đăng

source: Next
vi: Tiếp theo

source: Back
vi: Quay lại

source: Completed
vi: Hoàn thành

source: Loading...
vi: Đang tải...

source: Profile
vi: Hồ sơ

source: Settings
vi: Cài đặt

source: notifications
vi: Thông báo

source: Search
vi: Tìm kiếm

source: Home
vi: Trang chủ

source: About
vi: Giới thiệu

# username_hint
source: Enter your username
vi: Nhập tên đăng nhập của bạn

# phone_number_hint
source: Enter your phone number
vi: Nhập số điện thoại của bạn

# otp_hint
source: Enter your OTP
vi: Nhập OTP

source: Household
vi: Hộ gia đình

source: Collector
vi: Người thu gom

# profile_setup_primary
source: Your green tree is growing
vi: Cây xanh của bạn đang phát triển

source: Profile Setup
vi: Thiết lập hồ sơ

# profile_setup_step1
source: Step 1 of 3
vi: Bước 1 trong 3

# profile_setup_step2
source: Step 2 of 3
vi: Bước 2 trong 3

# profile_setup_step3
source: Step 3 of 3
vi: Bước 3 trong 3

source: Location
vi: Địa điểm

source: Street Address
vi: Địa chỉ

# street_address_hint
source: 123 Green Street
vi: nam kỳ khởi nghĩa

# street_address_location_hint
source: 600 Brasher Rd, Morgan City, St. Mary Parish, Louisiana, 70380 United States
vi: 72 Lê Thánh Tôn, Bến Nghé, Quận 1, TP. Hồ Chí Minh

source: City
vi: Thành Phố

source: Zip Code
vi: Mã zip

source: All Set!
vi: Tất cả đã được thiết lập

# all_set_message
source: Your profile is ready. Let’s start making a difference together!
vi: Hồ sơ của bạn đã sẵn sàng. Hãy làm điều khác biệt với chúng tôi!

source: Make an impact!
vi: Tạo ảnh hưởng nào!

source: Your impact
vi: Tác động của bạn

# keep_your_tree
source: Keep recycling to grow your tree
vi: Tiếp tục tái chế để trồng cây của bạn

source: points
vi: điểm

source: Accepted
vi: Được chấp nhận

source: Available
vi: Có sẵn

source: Rejected
vi: từ chối

source: Create New
vi: Tạo Mới

source: My Recycling Post
vi: Bài viết tái chế của tôi

source: Transaction detail
vi: Chi tiếc giao dịch

# see_all_posts
source: List post
vi: Xem danh sách bài viết

source: Recycling
vi: tái chế

source: Post Title
vi: Tiêu đề bài đăng

source: Description
vi: Mô tả

source: Pickup Address
vi: Địa chỉ lấy

source: Pickup Time
vi: Thời gian lấy

source: Add Scrap Items
vi: Thêm các phế liệu

source: Category
vi: Phân loại

source: Quantity
vi: Số lượng

# weight
source: Weight (kg)
vi: Cân nặng (kg)

source: Add
vi: Thêm

# post_title_hint
source: plastic package
vi: Thùng chai nhựa

# description_hint
source: container for used plastic bottles
vi: Rất nhiều chai nhựa

# pickup_addres_hint
source: 123 green street
vi: 123 đường xanh

# pickup_time_hint
source: monday to friday 5 PM
vi: thứ 2 dến thứ 6 5 giờ chiều

source: Amount Description
vi: Mô tả số lượng

# amount_description_hint
source: E.g., 5kg of newspapers, 20 bottles, 3 bags of plastic
vi: VD: 5kg giấy báo, 20 chai, 3 túi nhựa

# amount_description_helper
source: Describe quantity, weight, or packaging details
vi: Mô tả số lượng, khối lượng hoặc chi tiết đóng gói

source: AI Suggestion
vi: Gợi ý từ AI

source: Reject
vi: Từ chối

source: Quick templates:
vi: Mẫu nhanh:

# template_small_bag
source: Small bag (~2kg)
vi: Túi nhỏ (~2kg)

# template_medium_box
source: Medium box (~5kg)
vi: Thùng vừa (~5kg)

# template_large_bundle
source: Large bundle (~10kg)
vi: Bó lớn (~10kg)

# template_multiple_items
source: Multiple items
vi: Nhiều món

# please_enter_description
source: Please enter amount description
vi: Vui lòng nhập mô tả số lượng

# description_too_short
source: Description is too short (minimum 5 characters)
vi: Mô tả quá ngắn (tối thiểu 5 ký tự)

source: scrap item
vi: vật phẩm phế liệu

source: image
vi: hình ảnh

# are_you_sure
source: Are you sure you want to delete this post? This action cannot be undone.
vi: Bạn có chắc chắn muốn xóa bài viết này không, hành động không thể hoàn tác.

# reason_delete
source: Reason for deletion (Optional)
vi: Lý do xóa bài (không bắt buộc)

# delete_hint
source: Why are you deleting this post?
vi: tại sao lại muốn xóa

# search_by_name_trash
source: search by name of trash
vi: tìm kiếm theo loại rác

source: All
vi: Tất cả

source: List
vi: Danh sách

source: Detail
vi: Chi tiết

source: Posted
vi: Ngày đăng bài

source: items
vi: vật phẩm

# network_error
source: Network connection error
vi: Lỗi kết nối mạng

# server_error
source: Server is not responding
vi: Máy chủ không phản hồi

# cache_error
source: Cache read/write error
vi: Lỗi bộ nhớ đệm

# unauthorized
source: You are not authorized
vi: Bạn chưa được xác thực

# not_found
source: Requested resource not found
vi: Không tìm thấy tài nguyên

# unexpected_error
source: An unexpected error occurred
vi: Đã xảy ra lỗi không xác định

source: Theme
vi: Chủ đề

source: Mode
vi: chế độ

source: Theme light
vi: Chủ đề sáng

source: Theme dark
vi: Chủ đề sáng

source: Information
vi: Thông tin

source: Security
vi: Bảo mật

source: Help center
vi: Trung tâm hỗ trợ

source: Change your phone
vi: Thay đổi số sdt

# faq_and_support
source: FAQs and support
vi: Câu hỏi và hỗ trợ

source: Full name
vi: Họ và tên

source: Language
vi: Ngôn ngữ

# vi
source: vietnamess
vi: Tiếng việt

# en
source: english
vi: Tiếng anh

source: Reward
vi: Phần Thưởng

source: Dashboard
vi: Thống Kê

# keep_making_difference
source: Keep making a difference
vi: Tiếp tục làm điều khác biệc

source: This Week
vi: Tuần này

source: Rank
vi: Thứ hạng

# achievement
source: Achievements
vi: Thành tựu

source: View All
vi: Xem tất cả

source: Redeem Rewards
vi: Đổi thưởng

source: View All History
vi: Xem tất cả lịch sử

source: value
vi: Giá trị

source: Status
vi: Trạng thái

source: Transaction History
vi: Lịch sử giao dịch

source: Reward Store
vi: Cửa hàng phần thưởng

# your_point
source: Your points
vi: Điểm thưởng của bạn

source: Cart Total
vi: Tổng giỏ hàng

source: Redeem
vi: Phần thưởng

source: Items redeemed successfully!
vi: Đã đổi quà thành công!

source: Accept Proposed Time
vi: Chấp nhận thời gian đề xuất

# by_complete_transaction
source: By completing this transaction, you’re helping reduce waste
vi: Bằng cách hoàn tất giao dịch này, bạn đang giúp giảm thiểu chất thải

source: Proposed Time
vi: Thời gian đề xuất

source: Decline
vi: Từ chối

source: Accept
vi: Chấp nhận

source: Select Meeting Time
vi: Chọn ngày gặp mặt

source: Approve Transaction
vi: Chấp nhận giao dịch

# slogan_confirm_detail_1
source: Both parties must confirm the weight and price
vi: Cả hai bên phải xác nhận trọng lượng và giá cả

# slogan_confirm_detail_2
source: Together we’re making a difference
vi: Cùng nhau chúng ta tạo nên sự khác biệt

source: Confirm Details
vi: Xác nhận chi tiết

source: How was your transaction
vi: Giao dịch của bạn thế nào

source: Rating
vi: Đánh giá

source: Your Review
vi: Đánh giá của bạn

# your_review_hint
source: Write your feedback...
vi: viết đánh giá...

source: Report an issue
vi: Báo cáo vấn đề

source: Attach Photo
vi: Kèm hình ảnh

source: Tap to upload photo
vi: Ấn để thêm hình

# decribe_your_issue_hint
source: Describe your issue....
vi: Mô tả vấn đề của bạn....

# submit_feedback
source: Submi Feedback
vi: Nộp đánh giá

source: Message
vi: Tin nhắn

# message_hint
source: Search messages...
vi: Tin nhắn .....

source: Online
vi: Đang hoạt động

source: Invalid phone number
vi: Số điện thoại không hợp lệ

# invalid_otp_message
source: OTP is not invalid
vi: OTP không hợp lệ

# invalid_phone_number_length
source: phone number must be lager 9 numbers
vi: Std phải lớn hơn 9 chữ số

source: Resend otp
vi: Gửi lại otp

source: Verification
vi: Xác thực số điện thoại

# enter_the_code
source: Enter the code sent to the number
vi: Nhập mã được gửi vào SDT

# didnt_get_code
source: Didn't receive code?
vi: Bạn chưa nhận được code?

source: Resend
vi: Gửi lại

source: State province
vi: Tỉnh

# state_province_hint
source: California
vi: Bình Dương

source: Country
vi: Quốc gia

# country_hint
source: vietnam
vi: Việt Nam

source: Ward / Commune
vi: Phường / Xã

# ward_commune_hint
source: ward
vi: xã thuận an

source: Personal Information
vi: Thông tin cá nhân

source: FullName
vi: Họ và tên

source: Gender
vi: Giới tính

source: Date of Birth
vi: Ngày sinh

source: Male
vi: Nam

source: Female
vi: Nữ

source: Other
vi: Khác

# street_address_error
source: Enter address
vi: Nhập tên đường

# ward_commune_error
source: Enter ward commune
vi: Nhập tên phường/xã

# state_province_error
source: Enter state province
vi: Nhập tên tỉnh

# zip_code_error
source: Enter zip code
vi: Nhập mã zip của tỉnh

# country_error
source: Enter country error
vi: Nhập tên quốc gia

# street_address_length_error
source: Must be less than 50 charactors
vi: Phải nhỏ hơn 50 ký tự

# ward_commune_length_error
source: Must be less than 50 charactors
vi: Phải nhỏ hơn 50 ký tự

# state_province_length_error
source: Must be less than 50 charactors
vi: Phải nhỏ hơn 50 ký tự

# zip_code_format_error
source: Zip code invalid format ex: 12345-6789
vi: mã zip không phù hợp vd: 12345-6789

# country_length_error
source: Must be less than 50 charactors
vi: Phải nhỏ hơn 50 ký tự

source: Use Current Location
vi: Sử dụng vị trí hiện tại

# getting_location
source: Getting your location...
vi: Đang lấy vị trí của bạn...

# location_permission_denied
source: Location permission denied. Please enable location access in settings.
vi: Quyền truy cập vị trí bị từ chối. Vui lòng bật quyền truy cập vị trí trong cài đặt.

# location_service_disabled
source: Location services are disabled. Please enable them to use this feature.
vi: Dịch vụ vị trí đang bị tắt. Vui lòng bật để sử dụng tính năng này.

# location_permission_denied_forever
source: Location permission permanently denied. Please enable it in app settings.
vi: Quyền truy cập vị trí bị từ chối vĩnh viễn. Vui lòng bật trong cài đặt ứng dụng.

source: Location fetched successfully!
vi: Đã lấy vị trí thành công!

# error_getting_location
source: Error getting location. Please try again.
vi: Lỗi khi lấy vị trí. Vui lòng thử lại.

# please_enter_address
source: Please enter an address.
vi: Vui lòng nhập địa chỉ.

source: Enter full address
vi: Nhập địa chỉ đầy đủ

source: Confirm
vi: Xác nhận

# failed_to_get_address
source: Failed to get address from location. Please enter manually.
vi: Không thể lấy địa chỉ từ vị trí. Vui lòng nhập thủ công.

source: Validating address...
vi: Đang xác thực địa chỉ...

# address_validation_failed
source: Could not verify this address. Please check and try again.
vi: Không thể xác minh địa chỉ này. Vui lòng kiểm tra và thử lại.

# address_validated_successfully
source: Address verified successfully!
vi: Địa chỉ đã được xác minh thành công!

source: an error occurred please try again
vi: Lỗi khi thực hiện tác vụ và điều hướng

# fullName_error
source: Enter fullname please!
vi: Nhập họ tên đầy đủ

# fullName_length_error
source: Must be larger than 2 charactors
vi: Phải lớn hơn hai ký tự

# gender_error
source: Choose gender
vi: Chọn giới tính

# date_of_birth_error
source: Choose date of birth
vi: Chọn ngày sinh

# fullname_required
source: Full name is required
vi: Họ và tên không được để trống

# max_length_255
source: Must not exceed 255 characters
vi: Không được vượt quá 255 ký tự

# phone_required
source: Phone number is required
vi: Số điện thoại không được để trống

# phone_invalid
source: Invalid phone number
vi: Số điện thoại không hợp lệ

# phone_invalid_format
source: Invalid phone number format
vi: Định dạng số điện thoại không đúng

# address_required
source: Address is required
vi: Địa chỉ không được để trống

# gender_required
source: Please select a gender
vi: Vui lòng chọn giới tính

source: Prefer not to say
vi: Không muốn trả lời

# dob_required
source: Please select a date of birth
vi: Vui lòng chọn ngày sinh

# dob_invalid
source: Invalid date of birth
vi: Ngày sinh không hợp lệ

# age_must_be_13
source: Age must be at least 13
vi: Tuổi phải từ 13 trở lên

source: Error
vi: Lỗi

source: Edit Profile
vi: Chỉnh sửa thông tin

source: Save
vi: Lưu

source: Please wait...
vi: Vui lòng chờ...

source: Profile updated successfully
vi: Hồ sơ của bạn đã được cập nhập

source: error occurred while updating profile
vi: Có lỗi khi cập nhập hồ sơ

# error_required
source: This field is required
vi: Trường này là bắt buộc

# error_invalid_length
source: Too short
vi: Quá ngắn

# error_post_title_min
source: Title must be at least 3 characters
vi: Tiêu đề phải có ít nhất 3 ký tự

# error_description_min
source: Description must be at least 10 characters
vi: Mô tả phải có ít nhất 10 ký tự

# error_pickup_address_min
source: Address must be at least 5 characters
vi: Địa chỉ phải có ít nhất 5 ký tự

# error_number_invalid
source: Enter a valid number
vi: Nhập một số hợp lệ

# error_quantity_invalid
source: Quantity must be greater than 0
vi: Số lượng phải lớn hơn 0

# error_weight_invalid
source: Weight must be greater than 0
vi: Khối lượng phải lớn hơn 0

# error_select_category
source: Please select a category
vi: Vui lòng chọn một danh mục

# error_scrap_item_empty
source: Please add at least one scrap item to continue
vi: Vui lòng thêm ít nhất một mục phế liệu để tiếp tục

# success_post_created
source: Post created successfully!
vi: Bài đăng đã được tạo thành công!

# too_many_request_error
source: You have sent too many requests. Please try again later.
vi: Bạn đã thực hiện quá nhiều yêu cầu. Vui lòng thử lại sau.

# network_error_message
source: Network error, please check your connection.
vi: Lỗi mạng. Vui lòng kiểm tra kết nối Internet.

# unknown_error
source: Unexpected error occurred. Please try again.
vi: Đã xảy ra lỗi. Vui lòng thử lại.

# error_general
source: Unsuccessful!
vi: Không thành công!

# error_invalid_address
source: Please search and confirm address!
vi: Hãy tìm kiếm địa chỉ và xác nhận hợp lệ

# take_all
source: Must take all
vi: Phải lấy tất cả

# take_all_description
source: Collector must take all items
vi: Người thu gôm phải lấy tất cả vật phẩm

source: Address not found!!!
vi: Không tìm thây địa chỉ trên

# address_invalid
source: Address is invalid
vi: Địa chỉ không hợp lệ

# address_found
source: Address was found
vi: Địa chỉ hợp lệ

source: Select Address
vi: Chọn địa chỉ

source: Change Address
vi: Đổi địa chỉ

source: Saved Locations
vi: Địa chỉ đã lưu

# no_saved_locations
source: No saved locations yet
vi: Chưa có địa chỉ đã lưu

source: Add New Location
vi: Thêm địa chỉ mới

source: Save This Location
vi: Lưu địa chỉ này

source: Location Name
vi: Tên địa chỉ

# location_name_hint
source: e.g., Home, Office, Warehouse
vi: vd: Nhà, Văn phòng, Kho hàng

source: Set as default
vi: Đặt làm mặc định

source: Edit Location
vi: Sửa địa chỉ

source: Delete Location
vi: Xóa địa chỉ

# confirm_delete_location
source: Are you sure you want to delete this location?
vi: Bạn có chắc muốn xóa địa chỉ này?

source: Location saved successfully!
vi: Đã lưu địa chỉ thành công!

source: Location deleted successfully!
vi: Đã xóa địa chỉ thành công!

# getting_current_location
source: Getting your location...
vi: Đang lấy vị trí của bạn...

# manual_address
source: Enter Address Manually
vi: Nhập địa chỉ thủ công

# or_divider
source: OR
vi: HOẶC

source: Skip
vi: Bỏ qua

source: Please enter location name
vi: Vui lòng nhập tên địa chỉ

# unset_default
source: Unset as default
vi: Bỏ mặc định

# error_invalid_number
source: Must be large than 0
vi: phải lớn hơn không

# error_no_internet
source: No internet connection. Please check your network.
vi: Không có kết nối Internet. Vui lòng kiểm tra lại mạng.

# error_session_expired
source: Session expired. Please log in again.
vi: Phiên đăng nhập đã hết hạn. Vui lòng đăng nhập lại.

# error_server_error
source: Server error. Please try again later.
vi: Lỗi máy chủ. Vui lòng thử lại sau.

# error_unknown
source: An unexpected error occurred.
vi: Đã xảy ra lỗi không xác định.

# error_category_exists
source: Category is existed, choose another
vi: Loại này đã có!, chọn loại khác

source: no post found
vi: Chưa có bài đăng

source: Open
vi: Đang mở

source: Partially Booked
vi: Đã đặt một phần

source: Fully Booked
vi: Đã đặt hết

source: Canceled
vi: Đã hủy

source: Unknown Status
vi: Không xác định

# you_have_no_recycling_posts
source: You have no posts yet
vi: Bạn vẫn chưa có bài đăng nào

source: Start sharing recycling posts
vi: Bắt đầu chia sẻ bài đăng tái chế nào

source: View Details
vi: Xem chi tiết

# go_to_transaction
source: Go transaction
vi: Giao dịch

source: Retry
vi: Thử lại

# error_scrap_category
source: Only one material type per post
vi: Chỉ có một loại tài liệu cho mỗi bài đăng

source: just now
vi: mới đây

source: minutes ago
vi: phút trước

source: hours ago
vi: giờ trước

source: yesterday
vi: hôm qua

source: days ago
vi: ngày trước

source: Booked
vi: Đã được đặt

source: Collected
vi: đã thu thập

source: successfully
vi: thành công!!!

# error_delete_post
source: This post cannot be deleted(processing or completed).
vi: Bài viết này không thể bị xóa (đang thực hiện hoặc đã hoàn thành).

source: Must take all
vi: Phải lấy hết

# must_take_all_desc
source: Collectors must take all items listed below.
vi: Người thu gôm phải lấy hết những gì có trong danh sách

source: Cannot get upload URL
vi: Không thể lấy URL tải lên

# error_occurred_while_updating_avatar
source: An error occurred while updating avatar
vi: Đã xảy ra lỗi trong quá trình cập nhật ảnh đại diện

source: Avatar updated successfully
vi: Cập nhật ảnh đại diện thành công

source: Upgrade to Collector
vi: Nâng cấp lên người thu gom

source: Account Verification
vi: Xác thực tài khoản

# cccd_guide_text
source: Please upload high-quality images of your ID card for verification.
vi: Vui lòng chụp rõ nét căn cước công dân/CMND của bạn để xác thực.

# front_image
source: Front Side
vi: Ảnh mặt trước

# back_image
source: Back Side
vi: Ảnh mặt sau

source: Upload Image
vi: Tải ảnh lên

source: Submit Verification
vi: Gửi xác thực

# cccd_upload_warning
source: Please upload front side of your ID!
vi: Vui lòng tải đủ 2 mặt CCCD!

# cccd_submit_success
source: Submitting verification request...
vi: Đang gửi yêu cầu xác thực...

# cccd_warning_rules
source: Do not cover your face, avoid blur, and do not take angled shots. Verification time: Instant verification with AI.
vi: Không che mặt, không bị mờ, không chụp nghiêng/góc khuất. Thời gian xác minh: trong vòng 24 - 48 giờ.

source: Buyer type
vi: Loại người thu gom

source: Update Verification
vi: Cập nhật xác thực

source: Verification updated successfully
vi: Cập nhật xác thực thành công

source: Update Account Type
vi: Cập nhật loại tài khoản

source: Switch Account Type
vi: Chuyển đổi loại tài khoản

# buyer_type_individual
source: Individual
vi: Cá nhân

# buyer_type_business
source: Business
vi: Doanh nghiệp

# send_verification_info
source: send verification info successfully
vi: gửi thông tin xác thực thành công

# login_error
source: Login unsuccessful, try it again
vi: Đăng nhập không thành công, thử lại sau nhé

source: Individual Collector
vi: Người thu gom cá nhân

source: Business Collector
vi: Doanh nghiệp thu gom

# household_role
source: Household
vi: Hộ dân

source: View offers
vi: Xem danh sách các đề nghị

source: All Offers
vi: Tất cả đề nghị

source: Post Offers
vi: Đề nghị của bài đăng

source: No Offers Found
vi: Không có đề nghị nào

# no_offers_yet
source: No {status} offers yet
vi: Chưa có đề nghị {status}

# no_offers_available
source: No offers available at the moment
vi: Hiện tại chưa có đề nghị nào

source: Something went wrong
vi: Đã xảy ra lỗi

source: Try again
vi: Thử lại

source: Pending
vi: Đang chờ

# items_count
source: {count} Item
vi: {count} vật phẩm

# items_count_plural
source: {count} Items
vi: {count} vật phẩm

# schedules_count
source: {count} Schedule
vi: {count} lịch hẹn

# schedules_count_plural
source: {count} Schedules
vi: {count} lịch hẹn

source: Pricing Details:
vi: Chi tiết giá:

source: Unknown
vi: Không rõ

# more_items
source: +{count} more items
vi: +{count} vật phẩm khác

# minutes_short
source: {count}m ago
vi: {count} phút trước

# hours_short
source: {count}h ago
vi: {count} giờ trước

# days_short
source: {count}d ago
vi: {count} ngày trước

source: Offer Details
vi: Chi tiết đề nghị

source: Collector Information
vi: Thông tin người thu gom

source: Pricing Information
vi: Thông tin giá cả

source: Schedule Proposals
vi: Lịch đề xuất

source: Post Information
vi: Thông tin bài đăng

# no_pricing_info
source: No pricing information available
vi: Không có thông tin giá cả

# no_schedules
source: No schedule proposals
vi: Chưa có lịch đề xuất

# no_post_info
source: Post information not available
vi: Thông tin bài đăng không khả dụng

source: Contact Collector
vi: Liên hệ người thu gom

source: Accept Offer
vi: Chấp nhận đề nghị

source: Reject Offer
vi: Từ chối đề nghị

source: Cancel Offer
vi: Hủy đề nghị

source: Restore Offer
vi: Khôi phục đề nghị

source: Confirm Accept
vi: Xác nhận chấp nhận

source: Confirm Reject
vi: Xác nhận từ chối

source: Confirm Cancel
vi: Xác nhận hủy

# accept_offer_message
source: Are you sure you want to accept this offer?
vi: Bạn có chắc chắn muốn chấp nhận đề nghị này?

# reject_offer_message
source: Are you sure you want to reject this offer?
vi: Bạn có chắc chắn muốn từ chối đề nghị này?

# cancel_offer_message
source: Are you sure you want to cancel this offer?
vi: Bạn có chắc chắn muốn hủy đề nghị này?

# restore_offer_message
source: Are you sure you want to restore this offer?
vi: Bạn có chắc chắn muốn khôi phục đề nghị này?

# offer_accepted_success
source: Offer accepted successfully
vi: Chấp nhận đề nghị thành công

# offer_rejected_success
source: Offer rejected successfully
vi: Từ chối đề nghị thành công

source: Create Offer
vi: Tạo đề nghị

source: Offer Prices
vi: Giá đề nghị

source: Proposed Pickup Time
vi: Thời gian nhận hàng đề xuất

source: Select Date & Time
vi: Chọn ngày & giờ

# please_select_time
source: Please select proposed pickup time
vi: Vui lòng chọn thời gian nhận hàng đề xuất

source: Please enter at least one price
vi: Vui lòng nhập ít nhất một giá

source: Invalid price
vi: Giá không hợp lệ

source: Update Pricing
vi: Cập Nhật Giá
